FILES/Enums/ТипыДополнительногоФункционала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыДополнительногоФункционала</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КомпонентСобытий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпонентЗагрузкиДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпонентВыгрузкиДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпонентПечатнойФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпонентОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Системный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FILES/Catalogs/ДополнительныйФункционал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ДополнительныйФункционал</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтладки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуОтладки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонОписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПубличнаяКомпонента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСкриптаШины</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриватныйСкрипт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкриптШины</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДопФункционала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДополнительногоФункционала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяВерсияСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяВерсияСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешКомпоненты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьОтправкуДанныхОбОшибкахРазработчикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенДляВыгрузкиВШину</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьАвтоматическоеОбновление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаТранзакцию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиСервера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокОбрабатываемыхСобытий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКОбъектуМетаданных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбрабатываемоеСобытие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительноеДействие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзображенияОписания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СсылкаНаИзображениеВШине</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазваниеИзображения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изображение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FILES/CommonModules/МаркетПлейсСервер/Ext/Module.bsl
Функция ВыполнитьПервоначальныйЗапуск(СсылкаНаДФ) Экспорт
	
	СписокОбработчиков = Новый Массив();
	
	Если БезопасныйРежим() = ЛОЖЬ Тогда
		Слеш = ПолучитьРазделительПутиСервера();
		ВременнаяДиректория = КаталогВременныхФайлов() + "i4b" + Слеш;
			
		РезПодключения = МаркетПлейсПовтИспользование.ОбработкаМП(СсылкаНаДФ);
		ОшибкаОбработки = РезПодключения.ОшибкаОбработки;
		ВОбработка = РезПодключения.ВОбработка;
		ИмяОбработки = РезПодключения.ИмяОбработки;
					
		Если НЕ ОшибкаОбработки Тогда
			Попытка
				Состояние = ВОбработка.ПервоначальныйЗапуск();
			Исключение
				Состояние = Новый Структура("Результат, Сообщение", Ложь, "Нет обработки первоначального запуска");
			КонецПопытки;
		КонецЕсли;		
	КонецЕсли;
	
	Возврат Состояние; 
КонецФункции

Функция СписокСобытий(СсылкаНаДФ) Экспорт
	
	СписокОбработчиков = Новый Массив();
	
	Если СсылкаНаДФ.ТипДопФункционала = Перечисления.ТипыДополнительногоФункционала.КомпонентСобытий Тогда
		Если БезопасныйРежим() = ЛОЖЬ Тогда
			Слеш = ПолучитьРазделительПутиСервера();
			ВременнаяДиректория = КаталогВременныхФайлов() + "i4b" + Слеш;
				
			РезПодключения = МаркетПлейсПовтИспользование.ОбработкаМП(СсылкаНаДФ);
			ОшибкаОбработки = РезПодключения.ОшибкаОбработки;
			ВОбработка = РезПодключения.ВОбработка;
			ИмяОбработки = РезПодключения.ИмяОбработки;
						
			Если НЕ ОшибкаОбработки Тогда
				Сведения = ВОбработка.СведенияОВнешнейОбработке();
				Для Каждого Команда ИЗ Сведения.Команды Цикл
					СписокОбработчиков.Добавить(Новый Структура ("ПутьКОбъектуМетаданных, ОбрабатываемоеСобытие, ДополнительноеДействие", Команда.Назначение, Команда.Событие, Команда.ДополнительноеДействие));
				КонецЦикла;
			КонецЕсли;		
		КонецЕсли;
	Иначе
		Сообщить("События поддерживаются только в компонентах с типом ""Компонент событий""");	
	КонецЕсли;
	
	Возврат СписокОбработчиков; 
КонецФункции

Функция УстановитьКЕШСеанса() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныйФункционалСписокОбрабатываемыхСобытий.ПутьКОбъектуМетаданных КАК ПутьКОбъектуМетаданных,
	               |	ДополнительныйФункционалСписокОбрабатываемыхСобытий.ОбрабатываемоеСобытие КАК ОбрабатываемоеСобытие,
	               |	ДополнительныйФункционалСписокОбрабатываемыхСобытий.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДополнительныйФункционал.СписокОбрабатываемыхСобытий КАК ДополнительныйФункционалСписокОбрабатываемыхСобытий
	               |ГДЕ
	               |	ДополнительныйФункционалСписокОбрабатываемыхСобытий.Ссылка.ТипДопФункционала = ЗНАЧЕНИЕ(Перечисление.ТипыДополнительногоФункционала.КомпонентСобытий)";
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	КЕШ = Новый Массив;
	Для Каждого СтрокаКЕШ ИЗ Выгрузка Цикл
		КЕШ.Добавить(ТЗВСтруктуру(Выгрузка, СтрокаКЕШ));
	КонецЦикла;
	
	Возврат КЕШ;	
КонецФункции

Функция СписокОбработчиков(Событие, Параметры) Экспорт
	
	СписокОбработчиков = Новый Массив();
	
	Если БезопасныйРежим() = ЛОЖЬ Тогда
		ИмяФормы = Параметры.ЭтаФорма;
		ДополнительноеДействие = Параметры.ДополнительноеДействие;
		
		Слеш = ПолучитьРазделительПутиСервера();
		ВременнаяДиректория = КаталогВременныхФайлов() + "i4b" + Слеш;
		
		ДетальныеЗаписи = МаркетПлейсПовтИспользование.СписокДопФункционалаМП();
		Для Каждого ВыборкаДетальныеЗаписи ИЗ ДетальныеЗаписи Цикл
			
			РезПодключения = МаркетПлейсПовтИспользование.ОбработкаМП(ВыборкаДетальныеЗаписи.Ссылка);
			ОшибкаОбработки = РезПодключения.ОшибкаОбработки;
			ВОбработка = РезПодключения.ВОбработка;
			ИмяОбработки = РезПодключения.ИмяОбработки;
						
			Если НЕ ОшибкаОбработки Тогда
				Сведения = ВОбработка.СведенияОВнешнейОбработке();
				Для Каждого Команда ИЗ Сведения.Команды Цикл
					// 
					Если (Команда.Событие = Событие ИЛИ Команда.Событие = "") И 
						(Команда.Назначение = ИмяФормы ИЛИ Команда.Назначение = "") И 
						(Команда.ДополнительноеДействие = ДополнительноеДействие ИЛИ Команда.ДополнительноеДействие = "")Тогда
						//
						Если Команда.Модуль = "Сервер" Тогда 
							СписокОбработчиков.Добавить(Новый Структура("Обработка, Команда", ВОбработка, Команда));
						Иначе
							КомандаКлиент = ТЗВСтруктуру(Сведения.Команды, Команда);
							СписокОбработчиков.Добавить(Новый Структура("Обработка, Команда", ИмяОбработки, КомандаКлиент));
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокОбработчиков; 
КонецФункции

Функция ПодключитьОбработку(СсылкаНаОбработку, Событие, Параметры) Экспорт
	
	Обработчик = Новый Структура("Обработка, Команда");
	
	Если БезопасныйРежим() = ЛОЖЬ Тогда
		ИмяФормы = Параметры.ЭтаФорма;
		ДополнительноеДействие = Параметры.ДополнительноеДействие;
		
		Слеш = ПолучитьРазделительПутиСервера();
		ВременнаяДиректория = КаталогВременныхФайлов() + "i4b" + Слеш;
		
		РезПодключения = МаркетПлейсПовтИспользование.ОбработкаМП(СсылкаНаОбработку);
		ОшибкаОбработки = РезПодключения.ОшибкаОбработки;
		ВОбработка = РезПодключения.ВОбработка;
		ИмяОбработки = РезПодключения.ИмяОбработки;
					
		Если НЕ ОшибкаОбработки Тогда
			Сведения = ВОбработка.СведенияОВнешнейОбработке();
			Для Каждого Команда ИЗ Сведения.Команды Цикл
				// 
				Если (Команда.Событие = Событие ИЛИ Команда.Событие = "") И 
					(Команда.Назначение = ИмяФормы ИЛИ Команда.Назначение = "") И 
					(Команда.ДополнительноеДействие = ДополнительноеДействие ИЛИ Команда.ДополнительноеДействие = "")Тогда
					//
					Если Команда.Модуль = "Сервер" Тогда 
						Обработчик = Новый Структура("Обработка, Команда", ВОбработка, Команда);
					Иначе
						КомандаКлиент = ТЗВСтруктуру(Сведения.Команды, Команда);
						Обработчик = Новый Структура("Обработка, Команда", ИмяОбработки, КомандаКлиент);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат Обработчик; 
КонецФункции


Функция ТЗВСтруктуру(ТаблицаЗ, СтрокаТЗ)
	
	НоваяСтрока = Новый Структура; 
	Для Каждого КолонкаТЗ ИЗ ТаблицаЗ.Колонки Цикл
		НоваяСтрока.Вставить(КолонкаТЗ.Имя, СтрокаТЗ[КолонкаТЗ.Имя]); 
	КонецЦикла;
	
	Возврат НоваяСтрока; 
КонецФункции
